In [1]:
dataset_id = "Hollywood"

In [2]:
!bq --location=US mk --dataset {dataset_id}

BigQuery error in mk operation: Dataset 'trim-cistern-288221:Hollywood' already
exists.

In [3]:
!bq --location=US load --field_delimiter=tab --autodetect --null_marker '\N' --quote "" --allow_jagged_rows --allow_quoted_newlines --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {dataset_id}.Title_Basics 'gs://bhnk-milestone1-data/Hollywood/title.basics.tsv'

Waiting on bqjob_r1e05cb1d489dd29d_000001759b934eca_1 ... (47s) Current status: DONE

In [4]:
!bq --location=US load --field_delimiter=tab --autodetect --null_marker '\N' --quote "" --allow_jagged_rows --allow_quoted_newlines --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {dataset_id}.Name_Basics 'gs://bhnk-milestone1-data/Hollywood/name.basics.tsv'

Waiting on bqjob_r6917ae3c9f9313e5_000001759b941265_1 ... (0s) Current status: DONE
BigQuery error in load operation: Error processing job 'trim-
cistern-288221:bqjob_r6917ae3c9f9313e5_000001759b941265_1': Provided Schema does
not match Table trim-cistern-288221:Hollywood.Name_Basics. Cannot add fields
(field: string_field_0)
Failure details:
- It looks like you are appending to an existing table with
autodetect enabled. Disabling autodetect may resolve this.

In [5]:
!bq --location=US load --field_delimiter=tab --autodetect --null_marker '\N' --quote "" --allow_jagged_rows --allow_quoted_newlines --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {dataset_id}.Title_Akas 'gs://bhnk-milestone1-data/Hollywood/title.akas.tsv'

Waiting on bqjob_r25d9a9e367a568ff_000001759b941c16_1 ... (64s) Current status: DONE

In [6]:
!bq --location=US load --field_delimiter=tab --autodetect --null_marker '\N' --quote "" --allow_jagged_rows --allow_quoted_newlines --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {dataset_id}.Title_Principals 'gs://bhnk-milestone1-data/Hollywood/title.principals.tsv'

Waiting on bqjob_r17b31d277980c019_000001759b95224a_1 ... (64s) Current status: DONE

In [7]:
!bq --location=US load --field_delimiter=tab --autodetect --null_marker '\N' --quote "" --allow_jagged_rows --allow_quoted_newlines --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {dataset_id}.Title_Episode 'gs://bhnk-milestone1-data/Hollywood/title.episode.tsv'

Waiting on bqjob_r11b98b912f63e57b_000001759b962895_1 ... (0s) Current status: DONE
BigQuery error in load operation: Error processing job 'trim-
cistern-288221:bqjob_r11b98b912f63e57b_000001759b962895_1': Provided Schema does
not match Table trim-cistern-288221:Hollywood.Title_Episode. Cannot add fields
(field: string_field_0)
Failure details:
- It looks like you are appending to an existing table with
autodetect enabled. Disabling autodetect may resolve this.

In [8]:
!bq --location=US load --field_delimiter=tab --autodetect --null_marker '\N' --quote "" --allow_jagged_rows --allow_quoted_newlines --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {dataset_id}.Title_Ratings 'gs://bhnk-milestone1-data/Hollywood/title.ratings.tsv'

Waiting on bqjob_r13877e8b654343d0_000001759b963260_1 ... (7s) Current status: DONE

In [9]:
!bq --location=US load --field_delimiter=tab --null_marker '\N' --quote "" --allow_jagged_rows --allow_quoted_newlines --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {dataset_id}.Basics 'gs://bhnk-milestone1-data/Hollywood/title.crew.tsv'

Waiting on bqjob_r6dae227c38b7d001_000001759b9658c6_1 ... (84s) Current status: DONE

In [10]:
!bq --location=US load --field_delimiter=tab --null_marker '\N' --quote "" --allow_jagged_rows --allow_quoted_newlines --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {dataset_id}.Title_Crew 'gs://bhnk-milestone1-data/Hollywood/title.crew.tsv'

Waiting on bqjob_r42b19dedfab913e3_000001759b97ad9a_1 ... (47s) Current status: DONE

In [11]:
!bq --location=US mk --dataset {"Bollywood"}

BigQuery error in mk operation: Dataset 'trim-cistern-288221:Bollywood' already
exists.

In [12]:
!bq --location=US load --autodetect --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {"Bollywood"}.Bolly_actors 'gs://bhnk-milestone1-data/Bollywood/bollywood-actors.csv'

Waiting on bqjob_r2a2d61d701bfd308_000001759b987577_1 ... (1s) Current status: DONE

In [13]:
!bq --location=US load --autodetect --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {"Bollywood"}.Bolly_actress 'gs://bhnk-milestone1-data/Bollywood/bollywood-actress.csv'

Waiting on bqjob_r553c15c88dc466b0_000001759b988345_1 ... (1s) Current status: DONE

In [14]:
!bq --location=US load --autodetect --skip_leading_rows=1 --max_bad_records=10000\
--source_format=CSV {"Bollywood"}.Bolly_movies 'gs://bhnk-milestone1-data/Bollywood/bollywood.csv'

Waiting on bqjob_r78da3f18d7213996_000001759b98912f_1 ... (2s) Current status: DONE

In [15]:
#queries for hollywood

In [16]:
%%bigquery 
SELECT primaryTitle, averageRating
FROM Hollywood.Title_Basics as b
JOIN Hollywood.Title_Ratings as r
ON b.tconst = r.tconst
ORDER BY averageRating DESC
LIMIT 10;

                                      primaryTitle  averageRating
0  The 2nd Commitment to Life AIDS Project Benefit           10.0
1  The 2nd Commitment to Life AIDS Project Benefit           10.0
2                         An Evening with Max Wall           10.0
3  The 2nd Commitment to Life AIDS Project Benefit           10.0
4  The 2nd Commitment to Life AIDS Project Benefit           10.0
5  The 2nd Commitment to Life AIDS Project Benefit           10.0
6  The 2nd Commitment to Life AIDS Project Benefit           10.0
7  The 2nd Commitment to Life AIDS Project Benefit           10.0
8  The 2nd Commitment to Life AIDS Project Benefit           10.0
9  The 2nd Commitment to Life AIDS Project Benefit           10.0

In [17]:
%%bigquery 
SELECT primaryName, primaryProfession
FROM Hollywood.Name_Basics
WHERE primaryProfession = 'actor'
ORDER BY primaryName
LIMIT 5;

    primaryName primaryProfession
0  !Gubi Tietie             actor
1  !Gubi Tietie             actor
2  !Gubi Tietie             actor
3  !Gubi Tietie             actor
4       $2 Tony             actor

In [18]:
%%bigquery 
SELECT startYear, primaryTitle
FROM Hollywood.Title_Basics
GROUP BY startYear, primaryTitle
HAVING startYear = 2018
LIMIT 10;

   startYear                              primaryTitle
0       2018  Storie di donne Dejavù Presente- Passato
1       2018                             Aflevering 14
2       2018                       Thrill of the Chase
3       2018                       Killer Reunion Bro!
4       2018   Deportivo Alavés vs Real Betis Balompié
5       2018                  Semeynyy biznes. Chast 1
6       2018                         Before He Appears
7       2018               2018: Heat Four - Round One
8       2018                              Episode #1.3
9       2018                                 Charlotte

In [19]:
%%bigquery 
SELECT primaryName, category
FROM Hollywood.Title_Principals as p
JOIN Hollywood.Name_Basics as n
ON p.nconst = n.nconst
ORDER BY primaryName
LIMIT 10;

                   primaryName category
0  !'aru Ikhuisi Piet Berendse     self
1  !'aru Ikhuisi Piet Berendse     self
2  !'aru Ikhuisi Piet Berendse     self
3  !'aru Ikhuisi Piet Berendse     self
4  !'aru Ikhuisi Piet Berendse     self
5  !'aru Ikhuisi Piet Berendse     self
6  !'aru Ikhuisi Piet Berendse     self
7  !'aru Ikhuisi Piet Berendse     self
8  !'aru Ikhuisi Piet Berendse     self
9  !'aru Ikhuisi Piet Berendse     self

In [20]:
%%bigquery 
SELECT primaryName, deathYear
FROM Hollywood.Name_Basics
WHERE deathYear < '0100'
ORDER BY deathYear
LIMIT 10;

       primaryName deathYear
0  Viktor Cholnoky      0005
1  Viktor Cholnoky      0005
2  Viktor Cholnoky      0005
3  Viktor Cholnoky      0005
4             Ovid      0017
5             Ovid      0017
6     Titus Livius      0017
7     Titus Livius      0017
8     Titus Livius      0017
9             Ovid      0017

In [21]:
#queries for bollywood

In [22]:
%%bigquery 
select Name, Height_in_cm_ from Bollywood.Bolly_actors
where Height_in_cm_ = 180
order by Name
limit 5

         Name  Height_in_cm_
0  Abhay Deol            180
1  Abhay Deol            180
2  Abhay Deol            180
3  Abhay Deol            180
4  Abhay Deol            180

In [23]:
%%bigquery 
select Name, Height_in_cm_ from Bollywood.Bolly_actress
where Name like 'D%'
order by Height_in_cm_
limit 5;

             Name  Height_in_cm_
0  Dimple Kapadia            159
1  Dimple Kapadia            159
2  Dimple Kapadia            159
3  Dimple Kapadia            159
4  Dimple Kapadia            159

In [24]:
%%bigquery 
SELECT Director, Title
FROM Bollywood.Bolly_movies
WHERE Director = 'Mani Ratnam'
GROUP BY Director, Title
ORDER BY Title;

      Director       Title
0  Mani Ratnam      Bombay
1  Mani Ratnam    Dil Se..
2  Mani Ratnam        Guru
3  Mani Ratnam      Raavan
4  Mani Ratnam  Thalapathi
5  Mani Ratnam        Yuva

In [25]:
%%bigquery 
SELECT Director, Title, Genre
FROM Bollywood.Bolly_movies
WHERE Genre = 'crime,thriller'
GROUP BY Title,  Director, Genre
LIMIT 10;

,Director,Title,Genre
0,Baburao Painter,Kalyan Khajina a.k.a. The Treasures of Khajina,"crime,thriller"
1,Manilal Joshi,Mojili Mumbai a.k.a. Slaves Of Luxury,"crime,thriller"
2,Guru Dutt,Baazi,"crime,thriller"
3,Nanabhai Bhatt,Ustad,"crime,thriller"
4,O. P. Ralhan,Mujrim,"crime,thriller"
5,Ravindra Dave,Aankh Micholi,"crime,thriller"
6,Ram Gopal Varma,Drohi,"crime,thriller"
7,Sanjay Bhatia,99.9 FM (film),"crime,thriller"
8,Abbas Mustan,Race,"crime,thriller"
9,Sanjay Gadhvi,Kidnap,"crime,thriller"

In [26]:
%%bigquery 
SELECT Director, Height_in_cm_
FROM Bollywood.Bolly_movies as m
JOIN Bollywood.Bolly_actors as a
ON m.Director = a.Name
ORDER BY Height_in_cm_ DESC
LIMIT 10;

     Director  Height_in_cm_
0  Dara Singh            188
1  Dara Singh            188
2  Dara Singh            188
3  Dara Singh            188
4  Dara Singh            188
5  Dara Singh            188
6  Dara Singh            188
7  Dara Singh            188
8  Dara Singh            188
9  Dara Singh            188

In [27]:
#queries that join both datasets

In [28]:
%%bigquery
SELECT DISTINCT primaryName, primaryProfession
FROM Bollywood.Bolly_actors as m
INNER JOIN Hollywood.Name_Basics as a
ON m.Name = a.primaryName
WHERE primaryProfession = "actor"
LIMIT 10;

      primaryName primaryProfession
0      Imran Khan             actor
1   Shashi Kapoor             actor
2     Manoj Kumar             actor
3     Sohail Khan             actor
4    Tiger Shroff             actor
5       Ali Fazal             actor
6       Jeetendra             actor
7    Akshay Kumar             actor
8  Vidyut Jammwal             actor
9    John Abraham             actor

In [29]:
%%bigquery
SELECT DISTINCT Title, titleType
FROM Bollywood.Bolly_movies as m
INNER JOIN Hollywood.Title_Basics as a
ON m.Title = a.primaryTitle
WHERE titleType = "movie"
LIMIT 10;

                  Title titleType
0               Caravan     movie
1             Maha Chor     movie
2  Insaaf Main Karoonga     movie
3                Sardar     movie
4                Bazaar     movie
5         Jantar Mantar     movie
6                Daulat     movie
7                Thokar     movie
8                 Sofia     movie
9                Chorus     movie